# Arithmatic operations

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({"name":["sai","Anil","Venkat"],"Telugu":[90,20,35],"English":[59,95,68]})
df

     name  Telugu  English
0     sai      90       59
1    Anil      20       95
2  Venkat      35       68

In [3]:
df["Total"] = df["Telugu"] + df["English"]
df

     name  Telugu  English  Total
0     sai      90       59    149
1    Anil      20       95    115
2  Venkat      35       68    103

In [4]:
df["Percentage"] = (df["Total"] / 200)*100

In [5]:
df

     name  Telugu  English  Total  Percentage
0     sai      90       59    149        74.5
1    Anil      20       95    115        57.5
2  Venkat      35       68    103        51.5

In [6]:
df["Status"] = (df["Telugu"] > 35) & (df["English"] > 35)

In [7]:
df

     name  Telugu  English  Total  Percentage  Status
0     sai      90       59    149        74.5    True
1    Anil      20       95    115        57.5   False
2  Venkat      35       68    103        51.5   False

In [8]:
df["Status"] = np.where((df["Telugu"] > 35) & (df["English"] > 35), "Pass", "Fail")

In [9]:
df

     name  Telugu  English  Total  Percentage Status
0     sai      90       59    149        74.5   Pass
1    Anil      20       95    115        57.5   Fail
2  Venkat      35       68    103        51.5   Fail

In [10]:
passing_condition = (df["Telugu"] > 35) & (df["English"] > 35)
df["Status"] = "Fail"
df.loc[passing_condition, "Status"] = "Pass"
df

     name  Telugu  English  Total  Percentage Status
0     sai      90       59    149        74.5   Pass
1    Anil      20       95    115        57.5   Fail
2  Venkat      35       68    103        51.5   Fail

In [11]:
df

     name  Telugu  English  Total  Percentage Status
0     sai      90       59    149        74.5   Pass
1    Anil      20       95    115        57.5   Fail
2  Venkat      35       68    103        51.5   Fail

In [14]:
df.columns

Index(['name', 'Telugu', 'English', 'Total', 'Percentage', 'Status'], dtype='object')

In [19]:
df.loc[df["Total"] > 110].sum()

name           saiAnil
Telugu             110
English            154
Total              264
Percentage       132.0
Status        PassFail
dtype: object

In [28]:
df.loc[:,"Telugu": "Total"]

   Telugu  English  Total
0      90       59    149
1      20       95    115
2      35       68    103

In [27]:
df.loc[:,"Telugu": "Total"].sum(axis=1)

0    298
1    230
2    206
dtype: int64

In [29]:
df

     name  Telugu  English  Total  Percentage Status
0     sai      90       59    149        74.5   Pass
1    Anil      20       95    115        57.5   Fail
2  Venkat      35       68    103        51.5   Fail

In [30]:
df['Total'].max()

149

In [31]:
df['Total'].min()

103

In [32]:
df['Total'].mode()

0    103
1    115
2    149
Name: Total, dtype: int64

In [33]:
df['Total'].mean()

122.33333333333333

In [34]:
df['Total'].count()

3

In [35]:
df['Total'].isna()

0    False
1    False
2    False
Name: Total, dtype: bool